artillery.yml
# config:
#   target: https://api.sirv.com/v2/token
#   # Enable the Playwright engine:
#   engines:
#     playwright: {}
#   processor: "./js-tests/artillery.mjs"
# scenarios:
#   - engine: playwright
#     testFunction: "artilleryTest"  # Cambia "helloFlow" a "uploadFileTest"

config:
  target: "https://api.sirv.com/v2/token"
  phases:
    - duration: 2
      arrivalRate: 2
  processor: './loadTests/getToken.js'
scenarios:
  - flow:
      - function: "getToken"



# config:
#   target: "https://api.sirv.com/v2/token"
#   phases:
#     - duration: 2
#       arrivalRate: 2
#   defaults:
#     headers:
#       Content-Type: "application/json"
# scenarios:
#   - flow:
#       - post:
#           url: "https://api.sirv.com/v2/token"
#           json:
#             clientId: "MCGhAoCRbvYGRqavd4qZMRKuRAC"
#             clientSecret: "6egmA6KTH0XamwKxmbctJ4+WWLwOnVXCp6An1/H5d7v/oFZTtvl4BYiTgseZHgCHWZBOzqfGCAS34BeU7LyUiQ=="
#       - capture:
#           as: response_body  # Nombre de la variable para almacenar la respuesta del cuerpo
#           token: "$.token"  # Capturar el cuerpo de la respuesta JSON


# config:
#   target: "https://api.sirv.com/v2/token"
#   phases:
#     - duration: 5
#       arrivalRate: 5
#   defaults:
#     headers:
#       Content-Type: "application/json"
# scenarios:
#   - name: "Scenario 1"
#     flow:
#       - post:
#           url: "/"
#           json:
#             clientId: "MCGhAoCRbvYGRqavd4qZMRKuRAC"
#             clientSecret: "6egmA6KTH0XamwKxmbctJ4+WWLwOnVXCp6An1/H5d7v/oFZTtvl4BYiTgseZHgCHWZBOzqfGCAS34BeU7LyUiQ=="
#       - think: 3 # Tiempo de espera de 3 segundos
#   - name: "Scenario 2"
#     flow:
#       - post:
#           url: "/"
#           json:
#             clientId: "another-client-id"
#             clientSecret: "another-client-secret"
#       - think: 5 # Tiempo de espera de 5 segundos