artillery_2.yml
config:
  target: "https://api.sirv.com/v2/token"
  phases:
    - duration: 2
      arrivalRate: 2
  processor: './loadTests/getToken.js'
  defaults:
    headers:
      content-type: "application/json"
  metrics:
    aggregation: "p95,p99,min,max,median,mean,stddev"
    detailed: true

scenarios:
  - flow:
      - function: "getToken"